import random

n = [3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]
n = random.choice(n)
print('Число на первой табличке: ' + str(n))

result = []
for i in range(1, 21):
    for j in range(1, 21):
        win = n % (i + j) == 0
        if i != j and j > i and win == True:
            result1 = str(i) + str(j)
            result.append(result1)
result = ''.join(map(str, result))
print('Нужный пароль: ' + result)

dict = {3: 12, 4: 13, 5: 1423, 6: 121524, 7: 162534, 8: 13172635, 9: 1218273645, 10: 141923283746, 11: 11029384756,
        12: 12131511124210394857, 13: 112211310495867, 14: 1611325212343114105968, 15: 1214114232133124115106978,
        16: 1317115262143531341251161079, 17: 11621531441351261171089, 18: 12151811724272163631545414513612711810,
        19: 118217316415514613712811910, 20: 13141911923282183731746416515614713812911}
print('Проверка на совпадение пароля из словаря: ', dict.get(n), 'Результат: ', int(result) == dict.get(n))
